#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/sean-ahn/iac/runs/run-rUkr3j9z9Eymt9dq

Waiting for the plan to start...

Terraform v1.0.5
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
github_repository.blog-web: Refreshing state... [id=blog-web]
github_repository.gotzdatacheck: Refreshing state... [id=gotzdatacheck]
github_repository.iac: Refreshing state... [id=iac]
tfe_organization.sean-ahn: Refreshing state... [id=sean-ahn]
github_repository_file.iac_CODEOWNERS: Refreshing state... [id=iac/.github/CODEOWNERS]
github_branch_protection.iac_main: Refreshing state... [id=MDIwOkJyYW5jaFByb3RlY3Rpb25SdWxlMjIwNjkyMTY=]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # github_repository.blog-web has been changed
  ~ resource "github_repository" "blog-web" {
      ~ etag                   = "W/\"0e3ca4488544928a4b3ffcc64296bbbc79b0b1c965b9e8eee70cd91dcfb4ccd1\"" -> "W/\"5c3abe32a4c083457376b7f57db26657cf8324c4e70e250e73ab61430301661f\""
        id                     = "blog-web"
        name                   = "blog-web"
        # (24 unchanged attributes hidden)
    }
  # github_repository.iac has been changed
  ~ resource "github_repository" "iac" {
      ~ etag                   = "W/\"2f51101f030f06f40f039acedc9b0a88795dfe8dd984b72883806229029001e5\"" -> "W/\"df11313259903fa78e82a8761b80527e8c0837b20aa819d6b02e558ed78217d1\""
        id                     = "iac"
        name                   = "iac"
        # (26 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_repository.user will be created
  + resource "github_repository" "user" {
      + allow_merge_commit     = false
      + allow_rebase_merge     = false
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = true
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + has_downloads          = false
      + has_issues             = true
      + has_projects           = false
      + has_wiki               = false
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + license_template       = "mit"
      + name                   = "user"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + topics                 = [
          + "buf-cli",
          + "buf-schema-registry",
          + "dynamodb",
          + "go",
          + "golang",
          + "grpc",
          + "jwt",
          + "protobuf",
          + "protocol-buffers",
        ]
      + visibility             = "public"
      + vulnerability_alerts   = true
    }

Plan: 1 to add, 0 to change, 0 to destroy.


```

</details>

*Pusher: @sean-ahn, Action: `pull_request`*